Repository: BravoBaldo/Translations
Catalog: Yocto/Official/Yocto_OmegaT/Yocto_OmegaT-level2.tmx
Source language: en_us
Languages: it_it

source: :term:`DESCRIPTION`: an extended description of the upstream project, possibly with multiple lines. If no reasonable description can be written, this may be omitted as it defaults to :term:`SUMMARY`.
it_it: :term:`DESCRIPTION`: una descrizione estesa del progetto upstream, eventualmente su più righe. Se non è possibile scrivere una descrizione adeguata, questa può essere omessa poiché il valore di default è :term:`SUMMARY`.

source: :term:`ESDK_CLASS_INHERIT_DISABLE`: A list of classes to remove from the :term:`INHERIT` value globally within the extensible SDK configuration.
it_it: :term:`ESDK_CLASS_INHERIT_DISABLE`: Elenco di classi da rimuovere dal valore :term:`INHERIT` a livello globale all'interno della configurazione dell'SDK estensibile.

source: :term:`ESDK_LOCALCONF_ALLOW`: A list of variables allowed through from the build system configuration into the extensible SDK configuration.
it_it: :term:`ESDK_LOCALCONF_ALLOW`: Un elenco di variabili consentite dalla configurazione del sistema di buld alla configurazione dell'SDK estensibile.

source: :term:`ESDK_LOCALCONF_REMOVE`: A list of variables not allowed through from the build system configuration into the extensible SDK configuration.
it_it: :term:`ESDK_LOCALCONF_REMOVE`: Elenco di variabili non consentite dalla configurazione del sistema di build alla configurazione dell'SDK estensibile.

source: :term:`EXTRA_IMAGECMD`: Specifies additional options for image creation commands. In this example, the "-lnp " option is used when creating the :wikipedia:`JFFS2 ` image.
it_it: :term:`EXTRA_IMAGECMD`: Specifica opzioni aggiuntive per i comandi di creazione delle immagini. In questo esempio, l'opzione "-lnp" viene utilizzata durante la creazione dell'immagine :wikipedia:`JFFS2 `.

source: :term:`EXTRA_IMAGEDEPENDS`: Recipes to build that do not provide packages for installing into the root filesystem but building the image depends on the recipes. Sometimes a recipe is required to build the final image but is not needed in the root filesystem. In this case, the U-Boot recipe must be built for the image.
it_it: :term:`EXTRA_IMAGEDEPENDS`: Ricette di compilazione che non forniscono pacchetti da installare nel filesystem di root, ma la cui creazione dell'immagine dipende da tali ricette. A volte una ricetta è necessaria per creare l'immagine finale, ma non è richiesta nel filesystem di root. In questo caso, la ricetta U-Boot deve essere compilata per l'immagine.

source: :term:`HOMEPAGE`: the URL to the upstream projects homepage.
it_it: :term:`HOMEPAGE`: l'URL della homepage del progetto upstream.

source: :term:`IMAGE_BOOT_FILES`: Files installed into the device's boot partition when preparing the image using the Wic tool with the ``bootimg_partition`` or ``bootimg_efi`` source plugin.
it_it: :term:`IMAGE_BOOT_FILES`: File installati nella partizione di avvio del dispositivo durante la preparazione dell'immagine tramite lo strumento Wic con il plugin sorgente ``bootimg_partition`` o ``bootimg_efi``.

source: :term:`IMAGE_FEATURES`: Specifies features to include in the image. Most of these features map to additional packages for installation.
it_it: :term:`IMAGE_FEATURES`: Specifica le funzionalità da includere nell'immagine. La maggior parte di queste funzionalità corrisponde a pacchetti aggiuntivi da installare.

source: :term:`IMAGE_FSTYPES`: The formats the OpenEmbedded build system uses during the build when creating the root filesystem. In this example, four types of images are supported.
it_it: :term:`IMAGE_FSTYPES`: I formati utilizzati dal sistema di build OpenEmbedded durante la creazione del filesystem root. In questo esempio, sono supportati quattro tipi di immagini.

source: :term:`IMAGE_INSTALL`: Lists out the base set of packages from which to install from the Package Feeds area.
it_it: :term:`IMAGE_INSTALL`: Elenca il set base di pacchetti da installare dall'area Package Feeds.

source: :term:`IMAGE_LINGUAS`: Determines the language(s) for which additional language support packages are installed.
it_it: :term:`IMAGE_LINGUAS`: Determina la/le lingua/e per cui vengono installati i pacchetti di supporto linguistico aggiuntivi.

source: :term:`Image`
it_it: :term:`Immagine`

source: :term:`KBRANCH`: Identifies the kernel branch that is validated, patched, and configured during the build.
it_it: :term:`KBRANCH`: Identifica il branch del kernel che viene convalidato, patchato e configurato durante la build.

source: :term:`KERNEL_DEVICETREE`: The names of the generated Linux kernel device trees (i.e. the ``*.dtb``) files. All the device trees for the various BeagleBone devices are included.
it_it: :term:`KERNEL_DEVICETREE`: I nomi dei device tree del kernel Linux generati (ovvero i file ``*.dtb``). Sono inclusi tutti i device tree per i vari dispositivi BeagleBone.

source: :term:`KERNEL_EXTRA_ARGS`: Additional ``make`` command-line arguments the OpenEmbedded build system passes on when compiling the kernel. In this example, ``LOADADDR=${UBOOT_ENTRYPOINT}`` is passed as a command-line argument.
it_it: :term:`KERNEL_EXTRA_ARGS`: Argomenti aggiuntivi della riga di comando ``make`` che il sistema di build OpenEmbedded passa durante la compilazione del kernel. In questo esempio, ``LOADADDR=${UBOOT_ENTRYPOINT}`` viene passato come argomento della riga di comando.

source: :term:`KERNEL_IMAGETYPE`: The type of kernel to build for the device. In this case, the OpenEmbedded build system creates a "zImage" image type.
it_it: :term:`KERNEL_IMAGETYPE`: Il tipo di kernel da compilare per il dispositivo. In questo caso, il sistema di build OpenEmbedded crea un'immagine di tipo "zImage".

source: :term:`KMACHINE`: Identifies the machine name as known by the kernel, which is sometimes a different name than what is known by the OpenEmbedded build system.
it_it: :term:`KMACHINE`: Identifica il nome della macchina come noto al kernel, che a volte è diverso dal nome noto al sistema di build OpenEmbedded.

source: :term:`LICENSE`: This variable specifies the license for the software. If you do not know the license under which the software you are building is distributed, you should go to the source code and look for that information. Typical files containing this information include ``COPYING``, :term:`LICENSE`, and ``README`` files. You could also find the information near the top of a source file. For example, given a piece of software licensed under the GNU General Public License version 2, you would set :term:`LICENSE` as follows::
it_it: :term:`LICENSE`: Questa variabile specifica la licenza del software. Se non si conosce la licenza con cui viene distribuito il software che si sta compilando, è necessario consultare il codice sorgente per trovare queste informazioni. I file tipici che contengono queste informazioni includono ``COPYING``, :term:`LICENSE` e ``README``. È possibile trovare queste informazioni anche all'inizio di un file sorgente. Ad esempio, dato un software con licenza GNU General Public License versione 2, si imposterebbe :term:`LICENSE` come segue::

source: :term:`LIC_FILES_CHKSUM`: The OpenEmbedded build system uses this variable to make sure the license text has not changed. If it has, the build produces an error and it affords you the chance to figure it out and correct the problem.
it_it: :term:`LIC_FILES_CHKSUM`: Il sistema di build di OpenEmbedded utilizza questa variabile per verificare che il testo della licenza non sia cambiato. In caso contrario, la compilazione genera un errore, offrendoti la possibilità di individuarlo e correggerlo.

source: :term:`LINUX_VERSION`: The Linux version from kernel.org used by the OpenEmbedded build system to build the kernel image.
it_it: :term:`LINUX_VERSION`: La versione di Linux da kernel.org utilizzata dal sistema di build OpenEmbedded per creare l'immagine del kernel.

source: :term:`MACHINE_EXTRA_RRECOMMENDS`: A list of machine-dependent packages not essential for booting the image. Thus, the build does not fail if the packages do not exist. However, the packages are required for a fully-featured image.
it_it: :term:`MACHINE_EXTRA_RRECOMMENDS`: Un elenco di pacchetti dipendenti dalla macchina non essenziali per l'avvio dell'immagine. Pertanto, la build non fallisce se i pacchetti non sono presenti. Tuttavia, i pacchetti sono necessari per un'immagine completa.

source: :term:`MACHINE_FEATURES`: Specifies the list of hardware features the BeagleBone device is capable of supporting. In this case, the device supports "usbgadget usbhost vfat alsa".
it_it: :term:`MACHINE_FEATURES`: Specifica l'elenco delle funzionalità hardware supportate dal dispositivo BeagleBone. In questo caso, il dispositivo supporta "usbgadget usbhost vfat alsa".

source: :term:`OpenEmbedded-Core (OE-Core)` has two scripts that help to characterize and filter CVEs affecting the Linux kernel:
it_it: :term:`OpenEmbedded-Core (OE-Core)` dispone di due script che aiutano a caratterizzare e filtrare le CVE che interessano il kernel Linux:

source: :term:`OpenEmbedded-Core (OE-Core)` is well tested for reproducibility issues but other layers and their recipes and code may not be as well tested. Those reproducibility tests are available for others to run against their own layers and code.
it_it: :term:`OpenEmbedded-Core (OE-Core)` è stato ampiamente testato per la riproducibilità dei problemi, ma altri layer, le relative ricette e il codice potrebbero non essere stati testati altrettanto a fondo. Tali test di riproducibilità sono a disposizione di chiunque desideri eseguirli sui propri layer e sul proprio codice.

source: :term:`PACKAGE_ARCH` needing to be set before ``inherit packagegroup``
it_it: :term:`PACKAGE_ARCH` deve essere impostato prima di ``inherit packagegroup``

source: :term:`PACKAGE_ARCH`: Defines architecture-specific sub-folders. For example, packages could be available for the i586 or qemux86 architectures.
it_it: :term:`PACKAGE_ARCH`: Definisce le sottocartelle specifiche dell'architettura. Ad esempio, potrebbero essere disponibili pacchetti per le architetture i586 o qemux86.

source: :term:`PACKAGE_ARCH`: The architecture of the built package or packages. Depending on the eventual destination of the package or packages (i.e. machine architecture, :term:`Build Host`, SDK, or specific machine), :term:`PACKAGE_ARCH` varies. See the variable's description for details.
it_it: :term:`PACKAGE_ARCH`: L'architettura del pacchetto o dei pacchetti compilati. A seconda della destinazione finale del pacchetto o dei pacchetti (ad esempio, architettura della macchina, :term:`Build Host`, SDK o macchina specifica), :term:`PACKAGE_ARCH` varia. Per ulteriori dettagli, consultare la descrizione della variabile.

source: :term:`PACKAGE_CLASSES`: Specifies the package backend (e.g. RPM, DEB, or IPK) to use and consequently helps determine where to locate packages within the Package Feeds area.
it_it: :term:`PACKAGE_CLASSES`: Specifica il backend dei pacchetti (ad esempio RPM, DEB o IPK) da utilizzare e, di conseguenza, aiuta a determinare dove trovare i pacchetti nell'area Package Feeds.

source: :term:`PACKAGE_EXCLUDE`: Specifies packages that should not be installed into the image.
it_it: :term:`PACKAGE_EXCLUDE`: Specifica i pacchetti che non devono essere installati nell'immagine.

source: :term:`PACKAGE_INSTALL`: The final list of packages passed to the package manager for installation into the image.
it_it: :term:`PACKAGE_INSTALL`: L'elenco finale dei pacchetti passati al gestore di pacchetti per l'installazione nell'immagine.

source: :term:`PKGDATA_DIR`: A shared, global-state directory that holds packaging metadata generated during the packaging process. The packaging process copies metadata from :term:`PKGDESTWORK` to the :term:`PKGDATA_DIR` area where it becomes globally available.
it_it: :term:`PKGDATA_DIR`: Una directory condivisa [shared] a livello globale che contiene i metadati di packaging generati durante il processo di packaging. Tale processo copia i metadati da :term:`PKGDESTWORK` all'area :term:`PKGDATA_DIR` dove diventano disponibili a livello globale.

source: :term:`PKGDESTWORK`: A temporary work area (i.e. ``pkgdata``) used by the :ref:`ref-tasks-package` task to save package metadata.
it_it: :term:`PKGDESTWORK`: Un'area di lavoro temporanea (ovvero ``pkgdata``) utilizzata dal task :ref:`ref-tasks-package` per salvare i metadati dei pacchetti.

source: :term:`PKGDEST`: The parent directory (i.e. ``packages-split``) for packages after they have been split.
it_it: :term:`PKGDEST`: La directory genitore (ovvero ``packages-split``) per i pacchetti dopo che sono stati suddivisi.

source: :term:`PKGD`: The destination directory (i.e. ``package``) for packages before they are split into individual packages.
it_it: :term:`PKGD`: La directory di destinazione (ovvero ``package``) per i pacchetti prima che vengano suddivisi in singoli pacchetti.

source: :term:`PN`: The name of the recipe used to build the package. This variable can have multiple meanings. However, when used in the context of input files, :term:`PN` represents the name of the recipe.
it_it: :term:`PN`: Il nome della ricetta utilizzata per creare il pacchetto. Questa variabile può avere diversi significati. Tuttavia, quando utilizzata nel contesto dei file di input, :term:`PN` rappresenta il nome della ricetta.

source: :term:`PREFERRED_PROVIDER_virtual/kernel <PREFERRED_PROVIDER>`: Specifies the recipe that provides "virtual/kernel" when more than one provider is found. In this case, the recipe that provides "virtual/kernel" is "linux-yocto", which exists in the layer's ``recipes-kernel/linux`` directory.
it_it: :term:`PREFERRED_PROVIDER_virtual/kernel <PREFERRED_PROVIDER>`: Specifica la ricetta che fornisce "virtual/kernel" quando viene trovato più di un provider. In questo caso, la ricetta che fornisce "virtual/kernel" è "linux-yocto", che si trova nella directory ``recipes-kernel/linux``.

source: :term:`PREFERRED_PROVIDER_virtual/xserver <PREFERRED_PROVIDER>`: The recipe that provides "virtual/xserver" when more than one provider is found. In this case, the recipe that provides "virtual/xserver" is "xserver-xorg", available in ``meta/recipes-graphics/xorg-xserver`` in :term:`OpenEmbedded-Core (OE-Core)`.
it_it: :term:`PREFERRED_PROVIDER_virtual/xserver <PREFERRED_PROVIDER>`: La ricetta che fornisce "virtual/xserver" quando viene trovato più di un provider. In questo caso, la ricetta che fornisce "virtual/xserver" è "xserver-xorg", disponibile in ``meta/recipes-graphics/xorg-xserver`` in :term:`OpenEmbedded-Core (OE-Core)`.

source: :term:`PREFERRED_VERSION_linux-yocto <PREFERRED_VERSION>`: Defines the version of the recipe used to build the kernel, which is "6.18%" in this case.
it_it: :term:`PREFERRED_VERSION_linux-yocto <PREFERRED_VERSION>`: Definisce la versione della ricetta utilizzata per compilare il kernel, che in questo caso è "6.18%".

source: :term:`PV`: The version of the recipe used to build the package.
it_it: :term:`PV`: La versione della ricetta utilizzata per creare il pacchetto.

source: :term:`Recipe`
it_it: :term:`Ricetta`

source: :term:`SDKIMAGE_FEATURES`: Lists the features to include in the "target" part of the SDK.
it_it: :term:`SDKIMAGE_FEATURES`: Elenca le funzionalità da includere nella parte "target" dell'SDK.

source: :term:`SDKMACHINE`: Specifies the architecture of the machine on which the cross-development tools are run to create packages for the target hardware.
it_it: :term:`SDKMACHINE`: Specifica l'architettura della macchina su cui vengono eseguiti gli strumenti di cross-sviluppo per creare i pacchetti per l'hardware target.

source: :term:`SDKPATHINSTALL`: Defines the default SDK installation path offered by the installation script.
it_it: :term:`SDKPATHINSTALL`: Definisce il path di installazione di default dell'SDK offerto dallo script di installazione.

source: :term:`SDK_EXT_TYPE`: Controls whether or not shared state artifacts are copied into the extensible SDK. By default, all required shared state artifacts are copied into the SDK.
it_it: :term:`SDK_EXT_TYPE`: Controlla se gli artefatti dello "shared state" vengono copiati o meno nell'SDK estensibile. Per default, tutti gli artefatti dello "shared state" richiesti vengono copiati nell'SDK.

source: :term:`SDK_HOST_MANIFEST`: Lists all the installed packages that make up the host part of the SDK. This variable also plays a minor role for extensible SDK development as well. However, it is mainly used for the standard SDK.
it_it: :term:`SDK_HOST_MANIFEST`: Elenca tutti i pacchetti installati che compongono la parte host dell'SDK. Questa variabile svolge anche un ruolo secondario nello sviluppo di SDK estensibili. Tuttavia, viene utilizzata principalmente per l'SDK standard.

source: :term:`SDK_INCLUDE_PKGDATA`: Specifies whether or not packagedata is included in the extensible SDK for all recipes in the "world" target.
it_it: :term:`SDK_INCLUDE_PKGDATA`: Specifica se i dati del pacchetto vengono inclusi o meno nell'SDK estensibile per tutte le ricette nel target "world".

source: :term:`SDK_INCLUDE_TOOLCHAIN`: Specifies whether or not the toolchain is included when building the extensible SDK.
it_it: :term:`SDK_INCLUDE_TOOLCHAIN`: Specifica se la toolchain viene inclusa o meno durante la compilazione dell'SDK estensibile.

source: :term:`SDK_TARGET_MANIFEST`: Lists all the installed packages that make up the target part of the SDK. This variable also plays a minor role for extensible SDK development as well. However, it is mainly used for the standard SDK.
it_it: :term:`SDK_TARGET_MANIFEST`: Elenca tutti i pacchetti installati che compongono la parte target dell'SDK. Anche questa variabile svolge un ruolo secondario nello sviluppo di SDK estensibili. Tuttavia, viene utilizzato principalmente per l'SDK standard.

source: :term:`SERIAL_CONSOLES`: Defines one or more serial consoles (TTYs) to enable using getty.
it_it: :term:`SERIAL_CONSOLES`: Definisce una o più console seriali (TTY) da abilitare tramite getty.

source: :term:`SPL_BINARY`: Defines the Secondary Program Loader (SPL) binary type. In this case, the SPL binary is set to "MLO", which stands for Multimedia card LOader.
it_it: :term:`SPL_BINARY`: Definisce il tipo di binario del Secondary Program Loader (SPL). In questo caso, il binario SPL è impostato su "MLO", che sta per Multimedia card LOader.

source: :term:`SRCREV`: Identifies the revision of the source code used to build the image.
it_it: :term:`SRCREV`: Identifica la revisione del codice sorgente utilizzato per creare l'immagine.

source: :term:`SSTATE_SIG_KEY`: the GPG key identifier for signing shared state artifacts with the private key.
it_it: :term:`SSTATE_SIG_KEY`: l'identificativo della chiave GPG per la firma degli artefatti dello shared state con la chiave privata.

source: :term:`SSTATE_SIG_PASSPHRASE`: the passphrase used to protect your private key, chosen when creating the key pair.
it_it: :term:`SSTATE_SIG_PASSPHRASE`: la passphrase utilizzata per proteggere la chiave privata, scelta al momento della creazione della coppia di chiavi.

source: :term:`SSTATE_VALID_SIGS`: a space-separated list of key identifiers for which shared state artifacts are accepted.
it_it: :term:`SSTATE_VALID_SIGS`: un elenco di identificatori di chiave separati da spazi per i quali sono accettati artefatti di shared state.

source: :term:`SSTATE_VERIFY_SIG`: setting this variable to "1" enables the shared state signing feature.
it_it: :term:`SSTATE_VERIFY_SIG`: impostando questa variabile su "1" si abilita la funzionalità di firma dello shared state.

source: :term:`STAGING_DIR_HOST`: The path for the sysroot for the system on which a component is built to run (i.e. ``recipe-sysroot``).
it_it: :term:`STAGING_DIR_HOST`: Il path della directory di sistema (sysroot) del sistema su cui viene compilato un componente per l'esecuzione (ad esempio, ``recipe-sysroot``).

source: :term:`STAGING_DIR_NATIVE`: The path for the sysroot used when building components for the build host (i.e. ``recipe-sysroot-native``).
it_it: :term:`STAGING_DIR_NATIVE`: Il path della directory di sistema utilizzata per la compilazione dei componenti per l'host di compilazione (ad esempio, ``recipe-sysroot-native``).

source: :term:`STAGING_DIR_TARGET`: The path for the sysroot used when a component that is built to execute on a system and it generates code for yet another machine (e.g. :ref:`ref-classes-cross-canadian` recipes).
it_it: :term:`STAGING_DIR_TARGET`: Il path della directory di sistema utilizzata quando un componente, compilato per l'esecuzione su un sistema, genera codice per un'altra macchina (ad esempio, le ricette :ref:`ref-classes-cross-canadian`).

source: :term:`SUMMARY`: a one line description of the upstream project
it_it: :term:`SUMMARY`: una descrizione di una riga del progetto upstream.

source: :term:`S`: Contains the final location of the source code.
it_it: :term:`S`: Contiene la posizione finale del codice sorgente.

source: :term:`TARGET_OS`: The operating system of the target device. A typical value would be "linux" (e.g. "qemux86-poky-linux").
it_it: :term:`TARGET_OS`: Il sistema operativo del dispositivo target. Un valore tipico è "linux" (ad esempio. "qemux86-poky-linux").

source: :term:`TMPDIR`: The base directory where the OpenEmbedded build system performs all its work during the build. The default base directory is the ``tmp`` directory.
it_it: :term:`TMPDIR`: La directory base in cui il sistema di build OpenEmbedded esegue tutte le sue operazioni durante la compilazione. La directory base di default è ``tmp``.

source: :term:`TOOLCHAIN_HOST_TASK`: Lists packages that make up the host part of the SDK (i.e. the part that runs on the :term:`SDKMACHINE`). When you use ``bitbake -c populate_sdk imagename`` to create the SDK, a set of default packages apply. This variable allows you to add more packages.
it_it: :term:`TOOLCHAIN_HOST_TASK`: Elenca i pacchetti che costituiscono la parte host dell'SDK (ovvero la parte che viene eseguita su :term:`SDKMACHINE`). Quando si utilizza ``bitbake -c populate_sdk imagename`` per creare l'SDK, viene applicato un set di pacchetti di default. Questa variabile consente di aggiungere ulteriori pacchetti.

source: :term:`TOOLCHAIN_TARGET_TASK`: Lists packages that make up the target part of the SDK (i.e. the part built for the target hardware).
it_it: :term:`TOOLCHAIN_TARGET_TASK`: Elenca i pacchetti che compongono la parte target dell'SDK (ovvero la parte compilata per l'hardware di destinazione).

source: :term:`UBOOT_* <UBOOT_ENTRYPOINT>`: Defines various U-Boot configurations needed to build a U-Boot image. In this example, a U-Boot image is required to boot the BeagleBone device. See the following variables for more information:
it_it: :term:`UBOOT_* <UBOOT_ENTRYPOINT>`: Definisce le varie configurazioni di U-Boot necessarie per creare un'immagine U-Boot. In questo esempio, è necessaria un'immagine U-Boot per avviare il dispositivo BeagleBone. Per ulteriori informazioni, consultare le seguenti variabili:

source: :term:`UBOOT_MACHINE`: Specifies the value passed on the make command line when building a U-Boot image.
it_it: :term:`UBOOT_MACHINE`: Specifica il valore passato alla riga di comando make durante la creazione di un'immagine U-Boot.

source: :term:`UBOOT_SUFFIX`: Points to the generated U-Boot extension.
it_it: :term:`UBOOT_SUFFIX`: Indica l'estensione U-Boot generata.

source: :term:`UNPACKDIR`: Contains the unpacked source files for a given recipe.
it_it: :term:`UNPACKDIR`: Contiene i file sorgente decompressi per una determinata ricetta.
